cf_billing/Catalogs/энргТипыУзловУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>энргТипыУзловУчета</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидКанальности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыКанальности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СоставУзла</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипИзмерителя</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргТипыПриборовУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасположениеИзмерителя</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргРасположениеИзмерителей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РегистрируетОбъем</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВспомогательноеОборудование</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>IDСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Фаза</Name>
							<Type>
								<v8:Type>cfg:EnumRef.энргФазыТрансформатора</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ШкалыТипаИзмерителя</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Шкала</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргШкалыПриборовУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>IDСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf_billing/Catalogs/энргВидыКанальности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>энргВидыКанальности</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Шкалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Шкала</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргШкалыПриборовУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ШкалыПоУслугам</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Шкала</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргШкалыПриборовУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf_billing/Catalogs/энргТипыУзловУчета/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Для Каждого ТекСтр из Объект.СоставУзла Цикл
		ТекСтр.Шкалы 	= ЗаполнитьТекстСвойстваШкалы(ТекСтр.IDСтроки);
	КонецЦикла;
	
	ЗаполнитьДоступныеКВыборуШкалы();
КонецПроцедуры

#Конецобласти

&НаКлиенте
Процедура ВидКанальностиПриИзменении(Элемент)
	ЗаполнитьДоступныеКВыборуШкалы();
КонецПроцедуры


#Область СобытияТаблицыСоставУзла

&НаКлиенте
Процедура СоставУзлаПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		ТекущиеДанные = Элементы.СоставУзла.ТекущиеДанные;
		Если ТекущиеДанные = Неопределено Тогда
			Возврат;
		КонецЕсли;	
		
		ТекущиеДанные.IDСтроки 	= новый УникальныйИдентификатор;
		ТекущиеДанные.Шкалы 	= ЗаполнитьТекстСвойстваШкалы(ТекущиеДанные.IDСтроки); 		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СоставУзлаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле.Имя = "СоставУзлаШкалы" Тогда
		 ОткрытьФормуШкалыТипаИзмерителя();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СоставУзлаПередУдалением(Элемент, Отказ)
	ТекущиеДанные = Элементы.СоставУзла.ТекущиеДанные;
	ОчиститьШкалыТипаИзмерителя(ТекущиеДанные.IDСтроки);
КонецПроцедуры


&НаКлиенте
Процедура ОткрытьФормуШкалыТипаИзмерителя()
	ТекущиеДанные		= Элементы.СоставУзла.ТекущиеДанные;
	
	ОписаниеОповещения 	= Новый ОписаниеОповещения("ШкалыТипаИзмерителяЗавершение", ЭтотОбъект, Новый Структура("ТекущиеДанные", ТекущиеДанные));
	ОткрытьФорму("Обработка.энргОперацияУзламиУчета.Форма.ФормаШкалыТипаИзмерителя", ПолучитьМассивДоступныхШкал(ТекущиеДанные.IDСтроки),,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаСервере
Функция ПолучитьМассивДоступныхШкал(IDСтроки)
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("IDСтроки", IDСтроки);
	ШкалыИзмерителя = Объект.ШкалыТипаИзмерителя.НайтиСтроки(ПараметрыОтбора);
	мШкалИзмерителя = Новый Массив;
	Для каждого стр из ШкалыИзмерителя Цикл
		мШкалИзмерителя.Добавить(стр.Шкала);
	КонецЦикла;
	Возврат Новый Структура("ДоступныеКВыборуШкалы,ЗаполненныеШкалы", Обработки.энргОперацияУзламиУчета.ПолучитьМассивДоступныхШкал(ДоступныеКВыборуШкалы, Объект.ШкалыТипаИзмерителя), мШкалИзмерителя);
КонецФункции

&НаКлиенте
Процедура ШкалыТипаИзмерителяЗавершение(Результат, ДополнительныеПараметры) Экспорт	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные 		= ДополнительныеПараметры.ТекущиеДанные;
	
	ТекущиеДанные.Шкалы = ЗаполнитьТекстСвойстваШкалы(ТекущиеДанные.IDСтроки, Результат.ВыбранныеШкалы);
	ЗаполнитьШкалыИзРезультата(ТекущиеДанные.IDСтроки, Результат.ВыбранныеШкалы);
	
КонецПроцедуры

#КонецОбласти 


#Область ВспомогательныеПроцедурыИФункции

&НаСервере
Функция ЗаполнитьТекстСвойстваШкалы(IDСтроки, МассивСтрок = Неопределено)
	Если МассивСтрок = Неопределено Тогда
		МассивСтрок 	= Объект.ШкалыТипаИзмерителя.НайтиСтроки(Новый Структура("IDСтроки", IDСтроки));
	КонецЕсли;
	
	Текст = "";
	Для Каждого ТекШкала из МассивСтрок Цикл
		Текст = Текст + СокрЛП(ТекШкала.Шкала) + Символы.ПС;
	КонецЦикла;
	Текст = СокрЛП(Текст);
	
	Возврат ?(Текст = "", "Не заполнены", Текст);
КонецФункции

&НаСервере
Процедура ЗаполнитьДоступныеКВыборуШкалы()
	ДоступныеКВыборуШкалы.Очистить();	
	
	РезультатЗапроса 	= Справочники.энргВидыКанальности.ПолучитьШкалыВидаКанальности(Объект.ВидКанальности);
	Выборка 			= РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл		
		НоваяСтрока = ДоступныеКВыборуШкалы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьШкалыИзРезультата(IDСтроки, ВыбранныеШкалы)
	
	ОчиститьШкалыТипаИзмерителя(IDСтроки);
	
	Для Каждого ТекСтрЗаполнения из ВыбранныеШкалы Цикл
		НоваяСтрока = Объект.ШкалыТипаИзмерителя.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрЗаполнения);
		НоваяСтрока.IDСтроки = IDСтроки;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьШкалыТипаИзмерителя(IDСтроки)
	МассивСтрокУдаления = Объект.ШкалыТипаИзмерителя.НайтиСтроки(Новый Структура("IDСтроки", IDСтроки));
	Для Каждого ТекСтрУдаления из МассивСтрокУдаления Цикл
		Объект.ШкалыТипаИзмерителя.Удалить(ТекСтрУдаления);
	КонецЦикла;
КонецПроцедуры

#КонецОбласти
